<?php

/*==================================
#   Language File created by:      #
#           Blueberryy             #
==================================*/

$language = array(
	// general
	'language_name' 		=> "Русский",
	'select_language'	 	=> "Выберите язык",

	// general validation rules
	'required' 				=> "Поле %s является обязательным.",
	'valid_email'			=> "Поле %s должно содержать действительный адрес электронной почты.",
	'valid_emails' 			=> "Поле %s должно содержать все действительные адреса электронной почты.",
	'valid_ip' 				=> "Поле %s должно содержать действительный IP-адрес.",
	'min_length'			=> "Поле %s должно содержать не менее %s символов.",
	'max_length'			=> "Поле %s не может превышать %s символов.",
	'exact_length'			=> "Поле %s должно содержать ровно %s символов.",
	'min_value'				=> "Поле %s должно быть больше или равно %s.",
	'max_value'				=> "Поле %s должно быть меньше или равно %s.",
	'exact_value'			=> "Поле %s должно быть равно %s.",
	'alpha'					=> "Поле %s может содержать только алфавитные символы.",
	'alpha_numeric'			=> "Поле %s может содержать только буквенно-цифровые символы.",
	'alpha_dash'			=> "Поле %s может содержать только буквенно-цифровые символы, подчеркивания и дефисы.",
	'numeric'				=> "Поле %s должно содержать число.",
	'is_numeric'			=> "Поле %s должно содержать число.",
	'integer'				=> "Поле %s должно содержать целое число.",
	'matches'				=> "Поле %s не соответствует полю %s.",
	'is_natural'			=> "Поле %s должно содержать число.",
	'is_natural_no_zero'	=> "Поле %s должно содержать число больше нуля.",

	// file validation rules
	'is_dir'				=> "Поле %s должно содержать действительный путь к папке.",
	'is_file'				=> "Поле %s должно содержать действительный путь к файлу.",
	'is_writable'			=> "Папка или файл %s должны быть доступны для записи.",

	// database validation rules
	'db_params'				=> "Параметры MySQL в правиле проверки недействительны.",
	'db_connect'			=> "Не удалось подключиться к базе данных MySQL.",
	'db_select'				=> "Установлено соединение с MySQL, однако указанная база данных не может быть выбрана.",
	'db_error'				=> "Ошибка базы данных: %s",
	'db_error_query'		=> "Ошибка базы данных: %s <br/><br/>Запрос: %s",
	'db_batch'				=> "Пакетный запрос базы данных отформатирован неправильно.",
	'db_file'				=> "Файл базы данных %s не существует или недоступен для чтения.",

	// configuration and comparison rules
	'config_pass'			=> "ХОРОШО!",
	'config_fail'			=> "Ошибка",
	'config_yes'			=> "Да",
	'config_no'				=> "Нет",
	'config_available'		=> "Доступно",
	'config_unavailable'	=> "Недоступно",
	'config_greater_eq'		=> "Параметр %s должен быть больше или равен %s.",
	'config_less_eq'		=> "Параметр %s должен быть меньше или равен %s.",
	'config_greater'		=> "Параметр %s должен быть больше %s.",
	'config_less'			=> "Параметр %s должен быть меньше %s.",
	'config_eq'				=> "Параметр %s должен быть равен %s.",
	'config_php_error'		=> "Ваша конфигурация PHP не соответствует требованиям. Прежде чем продолжить, исправьте ошибки.",

	// file and folder permission rules
	'config_file_error'		=> "Ваши права доступа к файлам не соответствуют требованиям. Прежде чем продолжить, исправьте ошибки.",
	'config_writable'		=> "Запись",
	'config_file_none'		=> "Файл не существует.",
	'config_folder_none'	=> "Папка не существует.",
	'config_write_file'		=> "Файл недоступен для записи.",
	'config_write_folder'	=> "Папка недоступна для записи.",
	'config_readable'		=> "Чтение",
	'config_read_file'		=> "Файл не читается или не существует.",
	'config_read_folder'	=> "Папка не читается или не существует.",
);
